using System;
using System.Collections;
using System.Collections.Generic;
using UnityEngine;



//? [Transformation] 주로 "이동" 들이 들어있는 정도의 코드



namespace Pan.Util
{
    ///======================================================================================================================================================



    //? 트랜스폼 이동



    ///<summary>
    ///이동 타입
    /// </summary>
    public enum EMoveType
    {
        /// <summary>
        /// 실제 좌표가 이동되는 이동 타입
        /// </summary>
        Real,
        /// <summary>
        /// 실제 좌표가 이동되지 않는 이동 타입
        /// </summary>
        Fake
    }



    ///======================================================================================================================================================



    //? Transform 오브젝트 이동



    /// <summary>
    /// 인접한 지정된 위치로 좌표가 이동이 가능한 (Snap) 인터페이스
    /// </summary>
    public interface ISnapAbleTransform
    {
        void SnapTransform();
    }



    ///======================================================================================================================================================
}